Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: There’s a corresponding initializer for each approach: init(frame:) for programatically initializing the view and init?(coder:) for loading the view from the storyboard.
ja: それぞれの取り組み方に合ったイニシャライザがあります：ビューをプログラム的に初期化するためのinit(frame:)とビューをストーリーボードからロードするためのinit?(coder:)。

source: There’s a lot going on in this code.
ja: このコードにおいて多くのことが起こります。

source: There’s a lot going on in this code:
ja: このコードにおいて多くのことが起こります：

source: There’s a lot happening in the condition for this if statement.
ja: このif文の条件では多くの事が起こっています。

source: There’s a nuanced distinction between views and controls, which are specialized versions of views that respond to user actions in a specific way.
ja: ある微妙な相違がビューと、ビューの特殊化版でユーザアクションに特定の方法で応答するコントロールの間にはあります。

source: There’s a yellow warning triangle in the right side of the Activity viewer.
ja: 黄色い警告三角形がActivityビューアの右端にあります。

source: There’s also a red error icon beside the View Controller Scene in the Outline view.
ja: また赤いエラーアイコンがView Controller Sceneの隣にOutlineビューにおいて存在します。

source: These are placeholder implementations that you can uncomment and expand to define the table’s appearance and behavior.
ja: いくらかのプレースホルダ実装があって、あなたがコメントから外して拡張することでテーブルの外観と挙動を定義できます。

source: These comments describe how these methods can be used by your app.
ja: これらのコメントは、どのようにそれらのメソッドがあなたのアプリによって使用されることができるかを記述します。

source: These constraints indicate spacing to the nearest leading, trailing, and top neighbors.
ja: これらの制約は、最も近い前方、後方、そして上方の隣りとの間隔を示します。

source: These events result in the execution of the app’s logic and manipulation of its data.
ja: それらのイベントは、アプリのロジックの実行とそれのデータの操作に終わります。

source: These features can be accessed using the Update Frames button and Resolve Auto Layout Issues menu.
ja: これらの機能は、Update FramesボタンとResolve Auto Layout Issuesメニューを使ってアクセスされることができます。

source: These features include VoiceOver, Switch Control, playback of closed captioned or audio described video, Guided Access, Text to Speech, and more.
ja: これらの機能は、VoiceOver、Switch Control、聴力障害者用字幕付きまたは音声解説付きビデオの巻き戻し再生、Guided Access、Text to Speech、その他いろいろを含みます。

source: These initializers return optional values or implicitly unwrapped optional values, respectively.
ja: これらのイニシャライザは、それぞれオプショナル値または暗黙的にアンラップされるオプショナル値を返します。

source: These lessons assume developer mode is enabled.
ja: これらのレッスンは、開発者モードが有効にされると仮定します。

source: These lines define the size of your buttons and the number of buttons in your control.
ja: これらの行は、あなたのボタンの大きさとあなたのコントロールの中のボタンの数を定義します。

source: These lines encode the value of each property on the Meal class and store them with their corresponding key.
ja: これらの行は、Mealクラスに関する各プロパティの値をエンコードして、それらを格納するのにそれらの対応するキーを使います。

source: These lines load the star images from the assets catalog.
ja: それらの行は、星画像をアセットカタログからロードします。

source: These methods cause the app to terminate if the condition they are testing fails.
ja: これらのメソッドは、それらがテストする条件が失敗するならばアプリの終了を引き起こします。

source: These methods let the application object communicate with the app delegate.
ja: これらのメソッドは、アプリケーションオブジェクトにアプリデリゲートと通信させます。

source: These names make it easier to identify individual tests later on.
ja: これらの名前は、後で個々のテストを識別するのを容易にします。

source: They also help to define your class’s expected behavior.
ja: それらはまた、あなたのクラスの持つ期待される挙動を定義する助けとなります。

source: They are arranged horizontally, but there’s no space between them—making them look like a single, red block.
ja: それらは横には整えられます、しかしそれらの間の空きがありません — それらは単一の、赤いブロックのように見えます。

source: They are intended for debugging environments, and do not appear in a shipping app.
ja: それらはデバッグ環境として意図されます、そして出荷アプリでは現れません。

source: They are the building blocks for constructing your user interface and presenting your content in a clear, elegant, and useful way.
ja: それらは、あなたのユーザインターフェイスを組み立てるための、そしてあなたのコンテンツ（表示したいこと）をわかりやすく、優雅に、役に立つ形で提示するための建築ブロックです。

source: They become red when they are selected.
ja: それらが赤くなったらそれらが選択されたということです。

source: They predate storyboards and basically represent a single scene from a storyboard.
ja: 複数ストーリーボードの前のもので、基本的にひとつのストーリボードからただ１つだけのシーンを表します。

source: This else case executes only if the meal detail scene was not presented inside a modal navigation controller (for example, when adding a new meal), and if the meal detail scene was not pushed onto a navigation stack (for example, when editing a meal).
ja: このelseの状況は、食事詳細シーンがモーダルナビゲーションコントローラ内部で提示されなかった場合（例えば、新しい食事を加えている時）に、そして食事詳細シーンがナビゲーションスタック上にプッシュされなかった場合（例えば、食事を編集している時）にのみ実行されます。

source: This action adds the view as a subview of the RatingControl, and also instructs the RatingControl to create the constraints needed to manage the button’s position within the control.
ja: このアクションは、ビューをRatingControlのサブビューとして加えます、そしてまたボタンの位置をコントロール内で管理するのに必要とされる制約をRatingControlに作成するよう指示します。

source: This adds the new meal to the existing list of meals in the data model.
ja: これは新しい食事を、データモデルにおいて既存の食事のリストに加えます。

source: This also completes the app.
ja: これはまたアプリの完成でもあります。

source: This also means that the meal detail scene was pushed onto a navigation stack when the user selected a meal from the meal list.
ja: これはまた、食事詳細シーンがナビゲーションスタック上へとプッシュされたのは、ユーザが食事を食事リストから選択した時であるのを意味します。

source: This animates the addition of a new row to the table view for the cell that contains information about the new meal.
ja: これは、新しい食事についての情報を含んでいるセルのためのテーブルビューへ新しい行の追加をアニメーション（動画）にします。

source: This app shows a list of meals, including a meal name, rating, and photo.
ja: このアプリは、食事のリストを、食事名、レーティング（採点）、及び写真を含めて表示します。

source: This button updates the frames of the selected view and all of its subviews.
ja: このボタンは、選択されたビューおよびそれの全てのサブビューのフレームを更新します。

source: This causes Interface Builder to automatically update the frames of the affected views when you create the constraints.
ja: これは、あなたが制約を作成する時に影響を受けるビューのフレームをInterface Builderに自動的に更新させます。

source: This causes the navigation controller to push the meal detail scene onto the navigation controller’s stack.
ja: これはナビゲーションコントローラに、食事詳細シーンをナビゲーションコントローラの持つスタック上へプッシュさせます。

source: This cell is a prototype cell for the table.
ja: このセルは、テーブルのための原型セルです。

source: This change makes it impossible for the user to tap the Done key before typing text into the text field, ensuring that users can never enter an empty string as a meal name.
ja: この変更は、ユーザにDoneキーのタップをテキスト欄にテキストをタイプするまでは不可能にして、ユーザが絶対に空の文字列を食事名として入力することがないようにします。

source: This change will make the default Return key on the keyboard more pronounced to the user by changing it into a Done key.
ja: この変更は、もともとはReturnキーであるものをそのキーボード上でユーザにより目立つようにそれをDoneキーに変えます。

source: This code accesses the original, unedited image from the info dictionary.
ja: このコードは、オリジナル、未編集画像にinfoディクショナリからアクセスします。

source: This code adds any meals that were loaded to the meals array.
ja: このコードは何らかの食事を加えます、それはmeals配列にロードされたものです。

source: This code adds any meals that were successfully loaded to the meals array.
ja: このコードは、うまくロードされた食事があればmeals配列に加えます。

source: This code animates the dismissal of the image picker controller.
ja: このコードは、イメージピッカーコントローラの退去をアニメーションにします。

source: This code calculates a label string using the button’s index, then assigns it to the button’s accessibilityLabel property.
ja: このコードは、ラベル文字列をボタンの持つインデックスを使って算出します、それからそれをボタンのaccessibilityLabelプロパティに割り当てます。

source: This code checks whether a row in the table view is selected.
ja: このコードは、テーブルビューの中のある行が選択されるかどうかを調べます。

source: This code computes the location in the table view where the new table view cell representing the new meal will be inserted, and stores it in a local constant called newIndexPath.
ja: このコードはテーブルビューの中の場所を算出します、そこは新しい食事を表している新しいテーブルビューセルが挿入されるところです、そしてそれをローカル定数newIndexPathに格納します。

source: This code configures the meal property with the appropriate values before segue executes.
ja: このコードは、mealプロパティを適切な値を使ってセグエが終了する前に構成します。

source: This code creates a Boolean value that indicates whether the view controller that presented this scene is of type UINavigationController.
ja: このコードは、このシーンを提示したビューコントローラが型UINavigationControllerであるかどうかを指し示すブール値を作成します。

source: This code creates a special type of bar button item that has editing behavior built into it.
ja: このコードは、それに組み込まれた編集挙動を持つ特別な型のバーボタン項目を作成します。

source: This code creates constants from the current text field text, selected image, and rating in the scene.
ja: このコードは、そのシーンにおける現在のテキスト欄のテキスト、選択された画像、そして格付けから定数を作成します。

source: This code declares a property on MealTableViewController and initializes it with a default value (an empty array of Meal objects).
ja: この行は１つのプロパティをMealTableViewController上で宣言して、それを省略時の値で初期化します（Mealオブジェクトの空の配列）。

source: This code defines the basic properties for the data you need to store.
ja: このコードは、基本的なプロパティをあなたが格納しなければならないデータのために定義します。

source: This code disables the Save button while the user is editing the text field.
ja: このコードは、ユーザがテキスト欄を編集している間、Saveボタンを使用不能にします。

source: This code ensures that if the user taps the image view while typing in the text field, the keyboard is dismissed properly.
ja: このコードが請け負うのは、テキスト欄にタイプしている間にユーザがイメージビューをタップしたならば、キーボードがきちんと片付けられることです。

source: This code fetches the appropriate meal from the meals array.
ja: このコードは、適切な食事をmeals配列から取ってきます。

source: This code iterates over all of the rating control’s buttons.
ja: このコードは、格付けコントロールの持つボタンのすべてにわたって反復します。

source: This code iterates through the buttons and sets each one’s selected state based on its position and the rating.
ja: このコードはボタンのすべてに対して反復していって、それぞれのものの持つ選択済状態をそれの位置と格付けに基づいて設定します。

source: This code makes the table view show 1 section instead of 0.
ja: このコードは、テーブルビューが０ではなく１つのセクションを表示するようにします。

source: This code removes the Meal object to be deleted from meals.
ja: このコードは、Mealオブジェクトを削除して、mealsから消去されるようにします。

source: This code saves the meals array whenever a meal is deleted.
ja: このコードは、食事が削除される時はいつでも、meals配列を保存します。

source: This code saves the meals array whenever a new one is added or an existing one is updated.
ja: このコードは、meals配列を、新しいものが加えられるか既存のものが更新される時はいつでも保存します。

source: This code sets each of the views in the table view cell to display the corresponding data from meal object.
ja: このコードは、テーブルビューセルの中のビューそれぞれに、mealオブジェクトから対応するデータを表示させます。

source: This code starts by getting the destination view controller, the selected meal cell, and the index path of the selected cell.
ja: このコードは、デスティネーション（行先）ビューコントローラ、選択された食事セル、そして選択されたセルのインデックスパスを得ることによって始まります。

source: This code uses the as? operator so that it can return nil if the downcast fails.
ja: このコードは、as?演算子を使います、そのためそれはダウンキャストが失敗するならばnilを返すことができます。

source: This code uses the optional type cast operator (as?) to try to downcast the segue’s source view controller to a MealViewController instance.
ja: このコードはオプショナル型キャスト演算子（as?）を使って、このセグエのソースビューコントローラをダウンキャストしてMealViewControllerインスタンスにしようと試みます。

source: This code validates the incoming parameters and returns nil if they contain invalid values.
ja: このコードは、やってくるパラメータの正当性を立証して、それらが不正な値を含むならばnilを返します。

source: This code verifies that the sender is a button, and then uses the identity operator (===) to check that the objects referenced by the sender and the saveButton outlet are the same.
ja: このコードは、センダーがボタンであることを確かめて、それから同一性演算子（===）を使ってsenderオブジェクトとsaveButtonアウトレットが同じであることを確認します。

source: This comment indicates that this is the section of your code that lists actions.
ja: このコメントが示すのは、これがあなたのコードのアクションをリストする部分だということです。

source: This comment is used to organize your code and to help you (and anybody else who reads your code) navigate through it.
ja: このコメントは、あなたのコードを系統立てるために、そしてあなたが（およびあなたのコードを読む他の誰でも）それを見ていく助けとするために使われます。

source: This creates a constant with the identifier you set in the storyboard.
ja: これは、あなたがストーリーボードにおいて設定した識別子を使って定数を作成します。

source: This creates two properties.
ja: これは、２つのプロパティを作成します。

source: This declares a property on MealViewController that is an optional Meal, which means that at any point, it may be nil.
ja: これは、あるプロパティをMealViewController上で宣言します、それはオプショナルのMealです、それが意味するのはいずれかの時点でそれがnilであるかもしれないということです。

source: This delegate method manages changes to the table rows when it’s in editing mode.
ja: この委任先メソッドは、テーブルの列への変更を、それが編集モードの時に管理します。。

source: This description explains why your app wants to access the photo library.
ja: この説明は、なぜあなたのアプリがフォトライブラリにアクセスしたいのかを説明します。

source: This dismisses the meal detail scene, and returns the user to the meal list.
ja: これは食事詳細シーンを退去させます、そしてユーザを食事リストに戻します。

source: This ensures that the system can find and load the image.
ja: これは、システムが画像を見つけてロードできるのを確実にします。

source: This event has an advantage over .touchDown, because the user can cancel the event by dragging their finger outside the button before lifting it.
ja: このイベントには.touchDownの長所があります、なぜならユーザがイベントをキャンセルすることが彼らの指をボタンの外側にそれを持ち上げる前にドラッグすることで可能だからです。

source: This exclamation point indicates that the type is an implicitly unwrapped optional, which is an optional type that will always have a value after it is first set.
ja: この感嘆符は、その型が暗黙的にアンラップされるオプショナルであることを指し示します、それはオプショナル型で、常にある値をそれが最初に設定された後に持つことになります。

source: This failure typically happens because an array has not yet been saved.
ja: この失敗は、たいてい配列がまだ保存され終わっていないために起こります。

source: This file defines a custom subclass of UIViewController named ViewController.
ja: このファイルはViewControllerという名前のあつらえのUIViewControllerのサブクラス（下位クラス）を定義します。

source: This function prints a message to the standard output, which in this case is the Xcode debug console.
ja: この関数は、あるメッセージを標準出力に印字します、それはこの場合ではXcodeデバッグコンソールになります。

source: This gives your tests access to the internal elements of your app’s code.
ja: これは、あなたのテストがあなたのアプリのコードの内部要素へアクセスするようにします。

source: This implementation is only using the dismiss(animated:completion:) method to dismiss the meal detail scene because you’ve only had to account for the Add button so far.
ja: この実装は、dismiss(animated:completion:)を使って食事詳細シーンを退去させるだけです、なぜならあなたは今のところAddボタンだけを考慮すれば良いからです。

source: This imports the unified logging system.
ja: これは、統合ログシステムをインポートします。

source: This initializer calls init(frame:) and passes in a zero-sized rectangle.
ja: このイニシャライザは、init(frame:)を呼び出して大きさゼロの長方形を渡します。

source: This is a comment to help you (and anybody else who reads your code) know that the code in this section is related to data persistence.
ja: このコメントは、あなたが（そしてあなたのコードを読む他の誰でもが）この節のコードがデータ永続に関するものだと知る助けとなります。

source: This is a comment to help you (and anybody else who reads your code) know that this method is related to the navigation flow of your app.
ja: このコメントは、あなたが（そしてあなたのコードを読む他の誰でもが）このメソッドがあなたのアプリのナビゲーションの流れに関するものだと知る助けとなります。

source: This is a comment to help you (and anybody else who reads your code) navigate through your code and identify that this section applies to the image picker implementation.
ja: これはコメントであって、あなた（そしてあなたのコードを読む他の誰でも）があなたのコードをあちこち見ていく手助けをするもので、この部分がイメージピッカー実装に適用されるとわかるようにします。

source: This is a comment to help you (and anybody else who reads your code) navigate through your tests and identify what they correspond to.
ja: このコメントは、あなたが（そしてあなたのコードを読む他の誰でもが）あなたのテストをあちこち見ていって、それらが何に対応するのかを確認する助けとなります。

source: This is a directory where your app can save data for the user.
ja: これは、あなたのアプリがユーザからのデータを保存できるところのディレクトリです。

source: This is a helper method that you’ll use to update the selection state of the buttons.
ja: これはヘルパーメソッド（お手伝いさんメソッド）です、あなたはそれを使ってボタンの選択状態を更新するようにします。

source: This is a helper method to disable the Save button if the text field is empty.
ja: これはヘルパーメソッドで、テキスト欄が空ならばSaveボタンを使用不能にします。

source: This is a helper method to load sample data into the app.
ja: これはヘルパーメソッドで、見本データをアプリにロードします。

source: This is a navigation bar.
ja: これはナビゲーションバーです。

source: This is because the cell’s layout was not designed using Auto Layout.
ja: これは、セルのレイアウトが「自動レイアウト」を使って設計されなかったからです。

source: This is because the meal detail scene is embedded in its own navigation controller when it’s presented in this manner, which means that the navigation controller is what presents it.
ja: これは、食事詳細シーンがそれ独自のナビゲーションコントローラに埋め込まれるのはこの手法で表現される時であり、それはナビゲーションコントローラがそれを提示するのを意味するからです。

source: This is because you added your own bar button to the left side of the navigation bar.
ja: これは、あなたがあなた独自のバーボタンをナビゲーターバーの左側へ追加したからです。

source: This is the button’s default image.
ja: これは、ボタンの持つ省略時の画像です。

source: This is the navigation bar provided by the navigation controller.
ja: これは、ナビゲーションコントローラによって提供されたナビゲーションバーです。

source: This is where your implementation of UITextFieldDelegate methods comes in.
ja: これは、UITextFieldDelegateのあなたの実装のメソッドが登場するところです。

source: This lesson gets you familiar with Xcode, the tool you use to write apps.
ja: このレッスンは、あなたをXcodeに親しませます、それはあなたがアプリを書くために使うツールです。

source: This lets Interface Builder instantiate and draw a copy of your control directly in the canvas.
ja: これは、Interface Builderにあなたのコントロールのコピーを直接にキャンバスの中にインスタンス化させて描画させます。

source: This lets the data persist across multiple runs.
ja: これは、そのデータを複数の実行をまたいで永続させます。

source: This lets the system call your action method when the button is tapped.
ja: これは、システムにあなたのアクションメソッドをボタンがタップされる時に呼び出させます。

source: This lets the user know both the control’s current value and the result of tapping the currently selected button.
ja: これは、ユーザにコントロールの持つ値と、現在選択されたボタンをタップする結果の両方を知らせます。

source: This lets you easily access the full power of Auto Layout, while greatly reducing the complexity of your layout.
ja: これは、あなたを「自動レイアウト」の完全な能力に簡単にアクセスさせて、同時にあなたのレイアウトの複雑さを大いに減らします。

source: This lets you encapsulate and protect methods, ensuring that they are not unexpectedly or accidentally called from the outside.
ja: これは、あなたにメソッドをカプセル化させて保護させて、それらが思いがけなくまたは誤って外側から呼び出されないのを保証します。

source: This line is not strictly necessary.
ja: この行は、厳密には必要ではありません。

source: This line of code sets the image picker controller’s source, or the place where it gets its images.
ja: このコード行は、イメージピッカーコントローラのソースを、またはそれがそれの画像を得るところの場所を、設定します。

source: This logs a debug message to the console if the save succeeds, and an error message to the console if the save fails.
ja: これは、保存が成功するならばデバッグメッセージをコンソールに、そして保存が失敗するならばエラーメッセージをコンソールに記録します

source: This meal list becomes the initial scene for your app.
ja: この食事リストは、あなたのアプリの最初のシーンとなります。

source: This means an error occurred that was serious enough to cause the app to abort.
ja: これは、あるエラーが起こり、それはアプリ中断の原因となるのに十分に重大だったことを意味します。

source: This means that the app can load the images using the shorter UIImage(named:) method.
ja: これは、アプリは画像をより短いUIImage(named:)メソッドを使ってロードできるのを意味します。

source: This means that the calling code must validate the inputs before calling the initializer.
ja: これが意味するのは、コードの呼び出しはその入力を、イニシャライザを呼び出す前に検証されなければならないということです。

source: This means that the text field no longer fills the screen from margin to margin.
ja: これが意味するのは、テキスト欄はもはや余白から余白まで画面いっぱいではないということです。

source: This means the interface you created in the storyboard is simply a prototype for your cell.
ja: これが意味するのは、あなたがストーリーボードにおいて作成したインターフェイスが単純にあなたのセルに対する原型であるということです。

source: This means you can click the back button in the meal detail scene to get back to the meal list.
ja: これの意味は、あなたは戻るボタンを食事詳細シーンで押すことで、食事リストに戻れるということです。

source: This means you can implement the protocol’s methods to handle text input, and you can assign instances of the ViewController class as the delegate of the text field.
ja: これはあなたがプロトコルの持つメソッドを実装することでテキスト入力を取り扱うことができるのを意味します、そしてあなたはViewControllerクラスのインスタンスをテキスト欄の委任先として任命できます。

source: This means you can write its value as the abbreviated form .photoLibrary instead of UIImagePickerControllerSourceType.photoLibrary.
ja: これが意味するのは、あなたがその値をUIImagePickerControllerSourceType.PhotoLibraryではなく省略形.PhotoLibraryを使って書けるということです。

source: This method adds new buttons using the updated size and count; however, the current implementation doesn’t get rid of the old buttons.
ja: このメソッドは、新しいボタンを更新された大きさと数を使って追加します；しかしながら、現在の実装は古いボタンの除去をしません。

source: This method attempts to archive the meals array to a specific location, and returns true if it’s successful.
ja: このメソッドは、meals配列を特定の場所にアーカイブして、それがうまくいくならばtrueを返します。

source: This method attempts to unarchive the object stored at the path Meal.ArchiveURL.path and downcast that object to an array of Meal objects.
ja: このメソッドは、パスMeal.ArchiveURL.pathに格納されるオブジェクトをアンアーカイブして、そしてそのオブジェクトをMealオブジェクトからなる配列へとダウンキャストすることを試みます。

source: This method gives you a chance to dismiss the UIImagePickerController (and optionally, do any necessary cleanup).
ja: このメソッドはあなたにUIImagePickerControllerを片付ける機会を与えます（そして随意に、何らかの不可欠な掃除を行います）。

source: This method gives you a chance to do something with the image or images that a user selected from the picker.
ja: このメソッドはあなたにある機会を与えるので、それで何かをユーザがピッカーから選択した画像または複数の画像を使って行います。

source: This method has a return type of an optional array of Meal objects, meaning that it might return an array of Meal objects or might return nothing (nil).
ja: このメソッドは、Mealオブジェクトのオプショナル配列の型を返します、これは、それがMealオブジェクトの配列を返すか、または無（nil）を返すかもしれないのを意味しています。

source: This method is called prepare(for:sender:), and it gives you a chance to store data and do any necessary cleanup on the source view controller (the view controller that the segue is coming from).
ja: このメソッドは、prepare(for:sender:)と呼ばれます、そしてそれはあなたにデータの格納や何らかの必要な片付けをソース（発生）ビューコントローラ（セグエがそこから始まるビューコントローラ）上で行う機会を与えます。

source: This method must be marked with the IBAction attribute and take a segue (UIStoryboardSegue) as a parameter.
ja: このメソッドは、IBAction属性で記しされて１つのセグエ（UIStoryboardSegue）をパラメータとして取らなければなりません。

source: This method returns a Boolean value that indicates whether the system should process the press of the Return key.
ja: このメソッドはブール値を返します、それはシステムがReturnキーの押下を処理すべきかどうかを指し示します。

source: This method returns an array of URLs, and the first parameter returns an optional containing the first URL in the array.
ja: このメソッドはURLからなる配列を返します、そして最初パラメータは配列中の最初のURLを含んでいるオプショナルを返します。

source: This method returns an optional Int because the instance you’re searching for might not exist in the collection you’re searching.
ja: このメソッドは、オプショナルのIntを返します、なぜならあなたが探しているインスタンスがあなたがそこで見つけようとしているコレクションの中に存在しないかもしれないからです。

source: This method simply indicates that the content view has been added to the app’s view hierarchy.
ja: このメソッドは、単にコンテンツビューが間もなくアプリの持つビュー階層へ加えられたところであるのを指し示します。

source: This method simply indicates that the content view is about to be added to the app’s view hierarchy.
ja: このメソッドは、単にコンテンツビューが間もなくアプリの持つビュー階層へ加えられるところであるのを指し示します。

source: This occurs when the user touches the button, and then lifts their finger while the finger is still within the button’s bounds.
ja: これは、ユーザがボタンをタッチして、それから指がまだボタンの境界線内にある間に彼らの指を持ち上げる時に発生します。

source: This operation creates a property for the object in your view controller file, which lets you access and manipulate that object from code at runtime.
ja: この行動は、あなたのビューコントローラファイルの中にそのオブジェクトのためのプロパティを作成します、それはあなたにそのオブジェクトを実行時にコードからアクセスおよび操作させます。

source: This operation creates a method in your view controller file that gets triggered when a user interacts with the object that the action method is attached to.
ja: この操作は、あなたのビューコントローラファイルの中にひとつのメソッドを作成し、それはそのアクションメソッドが取り付けられたオブジェクトとユーザが相互作用するときに作動することになります。

source: This outlet is similar to the text field, except for its name and its type (which is UILabel, to match the type of object that’s in the storyboard).
ja: このアウトレットはテキスト欄と似ています、その名前とその型（それはUILabelです、ストーリーボードの中にあるオブジェクトの型に合わせて）を除いては。

source: This pattern is extremely common in iOS app programming, and you’ll be seeing much more of it throughout the lessons.
ja: このパターンは、iOSアプリプログラミングにおいて非常にありふれたものです、そしてあなたはこれらのレッスンを通してもっとたくさん見ることになるでしょう。

source: This property defines the navigation bar’s appearance for that view controller.
ja: このプロパティは、ナビゲーションバーの外観をそのビューコントローラに対して定義します。

source: This property stores a reference to the app’s window.
ja: このプロパティは、アプリのウインドウへの参照を格納します。

source: This protocol defines a number of methods you use to set up your app, to respond to the app’s state changes, and to handle other app-level events.
ja: このプロトコルは、あなたがあなたのアプリを設定するために、アプリの状態変化に応答するために、そして他のアプリ水準のイベントを取り扱うために使うための多くのメソッドを定義します。
